# error_messages/currency_errors.py

ADD_CURRENCY_FAILURE_REASONS = {
    0: "Неизвестная ошибка",
    1: "Название не может быть пустым",
    2: "Короткое имя не может быть пустым",
    3: "Тип валюты не входит в доступный диапазон",
    4: "Ограничения обмена не входят в диапазон",
    5: "Кошельки не могут быть пустыми",
    6: "Путь к иконке пуст"
}

GET_CURRENCY_DETAILS_FAILURE_REASONS = {
    0: "Неизвестная ошибка",
    1: "Валюта не найдена"
}

UPDATE_CURRENCY_FAILURE_REASONS = {
    0: "Неизвестная ошибка",
    1: "Валюта не найдена",
    2: "Название не может быть пустым",
    3: "Короткое имя не может быть пустым",
    4: "Ограничения обмена не входят в диапазон",
    5: "Путь к иконке пуст"
}
